import Template from "./Template";

const data = [
  {
    name: '中視',
    party: '民進黨',
    vote: 756663,
  },
  {
    name: '中視',
    party: '國民黨',
    vote: 646040,
  },
  {
    name: '中視',
    party: '親民黨',
    vote: 38915,
  },
  {
    name: '中視',
    party: '總有效得票數',
    vote: 1441618,
  },
  {
    name: "前 1000 大投票所",
    party: '民進黨',
    vote: 788227,
  },
  {
    name: "前 1000 大投票所",
    party: '國民黨',
    vote: 594190,
  },
  {
    name: "前 1000 大投票所",
    party: '親民黨',
    vote: 68121,
  },
  {
    name: "前 1000 大投票所",
    party: '總有效得票數',
    vote: 1294794,
  }
];

export default function CTV() {
  return (
    <Template
      channel="中視"
      data={data}
      peopleConfig={"報票人員前往930多個投開票所，至少38個激戰區的競選總部"}
      rawDataContent={"中天宣稱前往930個投開票所，我們以總票數、蔡英文票數、韓國瑜票數和宋楚瑜票數的前1000大投開票所來比較，中天報票總數比「前1000大」多313,595，蔡英文票比「蔡英文前1000大」多139,325，韓國瑜票比「韓國瑜前1000大」多55,369，宋楚瑜票數比「宋楚瑜前1000大」少36,843。中天僅有宋楚瑜的部分少於前1000大，至於總票數、蔡英文票數和韓國瑜票數則否，難稱合理。中天有必要解釋其報票的數值依據為何。"}
      KMTdecreDataContent={"即使中天是把國民黨的票都視為非自行佈局的投開票所，中天報票數是志工報票＋國民黨報票數，我們把中天票數扣除國民黨的票數，再與「前1000大」進行比對，僅有宋楚瑜的部分少於前1000大，總票數、蔡英文票數、韓國瑜票數仍高於前1000大，仍難稱合理。"}
      summary="中視有必要解釋其報票的數值依據為何。"
    ></Template>
  )
}