import Template from "./Template";

const data = [
  {
    name: '台視',
    party: '民進黨',
    vote: 740878,
  },
  {
    name: '台視',
    party: '國民黨',
    vote: 529586,
  },
  {
    name: '台視',
    party: '親民黨',
    vote: 66887,
  },
  {
    name: '台視',
    party: '總有效得票數',
    vote: 1337351,
  },
  {
    name: "前 1000 大投票所",
    party: '民進黨',
    vote: 788227,
  },
  {
    name: "前 1000 大投票所",
    party: '國民黨',
    vote: 594190,
  },
  {
    name: "前 1000 大投票所",
    party: '親民黨',
    vote: 68121,
  },
  {
    name: "前 1000 大投票所",
    party: '總有效得票數',
    vote: 1294794,
  },
  {
    name: "前 500 大投票所",
    party: '民進黨',
    vote: 415356,
  },
  {
    name: "前 500 大投票所",
    party: '國民黨',
    vote: 324021,
  },
  {
    name: "前 500 大投票所",
    party: '親民黨',
    vote: 36450,
  },
  {
    name: "前 500 大投票所",
    party: '總有效得票數',
    vote: 678776,
  },
];

export default function TTV() {
  return (
    <Template
      channel="台視"
      data={data}
      peopleConfig={"300名人力"}
      rawDataContent={"台視宣稱是記者、工程師和計票中心等總共300名人力，我們並不確定報票志工實際有多少，但我們暫時以300人都是計票志工來計算。我們以總票數、蔡英文票數、韓國瑜票數和宋楚瑜票數的前500大投開票所相比，台視開票總數比「前500大總票數」多658,575票，台視蔡英文票數比「蔡英文前500大」多325,522票，韓國瑜票數比「韓國瑜前500大」多205,565票，宋楚瑜票數比「宋楚瑜前500大」多30,437票。"}
      KMTdecreDataContent={"即使台視可以用300人來兼顧1000個投票所，等於一個報票志工要兼顧2到3家投開票所，並加計國民黨報票數，在總票數、蔡英文、韓國瑜、宋楚瑜等四項，台視報票數落在合理範圍。但這是監看小組的預估，而台視在16點40分的開票比率，跟同業相比算高。"}
      summary="台視有必要解釋其報票的數值依據為何。"
    ></Template>
  )
}