import Template from "./Template";

const data = [
  {
    name: '東森',
    party: '民進黨',
    vote: 740878,
  },
  {
    name: '東森',
    party: '國民黨',
    vote: 529586,
  },
  {
    name: '東森',
    party: '親民黨',
    vote: 66887,
  },
  {
    name: '東森',
    party: '總有效得票數',
    vote: 1337351,
  },
  {
    name: "前 1000 大投票所",
    party: '民進黨',
    vote: 788227,
  },
  {
    name: "前 1000 大投票所",
    party: '國民黨',
    vote: 594190,
  },
  {
    name: "前 1000 大投票所",
    party: '親民黨',
    vote: 68121,
  },
  {
    name: "前 1000 大投票所",
    party: '總有效得票數',
    vote: 1294794,
  },
  {
    name: "前 500 大投票所",
    party: '民進黨',
    vote: 415356,
  },
  {
    name: "前 500 大投票所",
    party: '國民黨',
    vote: 324021,
  },
  {
    name: "前 500 大投票所",
    party: '親民黨',
    vote: 36450,
  },
  {
    name: "前 500 大投票所",
    party: '總有效得票數',
    vote: 678776,
  },
];

export default function EBC() {
  const sameClaim = `東森宣稱有上千名報票志工，以總票數、蔡英文票數、韓國瑜票數和宋楚瑜票數的前1000大投開票所來相比，東森開票總數比前1000大多346,522，蔡英文票比蔡英文前1000大多137,028，韓國瑜票數比韓國瑜前1000大多38,509，宋楚瑜票數比宋楚瑜前一大千多15,241。

東森以上千名的人力報超過「開完票的前1000大」數值的票數，值得注意。\n`;
  return (
    <Template
      channel="東森"
      data={data}
      peopleConfig={"上千名報票員（另說450人）"}
      rawDataContent={sameClaim}
      KMTdecreDataContent={sameClaim + "\n若東森佈局的投開票所與國民黨報票系統不重疊，而把國民黨票數加總計入，東森的票數＝志工報票數＋國民黨報票數。若扣除國民黨票數，東森上千名的人力，所報的票數超過「開完票的前1000大」數值，若以「兩千大」來比較，東森開出來的票所佔比例超過五成。"}
      summary="東森報票數值對比之後，以最理想狀況（2000個投開票所＋國民黨計票），東森報票數落在合理範圍內，開票比率高於同業，但這項最理想值的假設，是監看小組的預設。因此，建議東森對外說明與解釋，其實際的計票中心人力、兼顧多少投開票所，以及實際的報票依據。"
    ></Template>
  )
}